app/views/users/show.html.erb

    <div class="col-md-8">
      <% @user.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]