app/controllers/items_controller.rb

  def create
    @user = current_user
    @item = @user.items.build(item_params)

    if @item.save
---
INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Learn Bootstrap"], ["user_id", 1], ["created_at", "2016-03-29 00:52:15.648689"], ["updated_at", "2016-03-29 00:52:15.648689"]]

  def destroy
    @user = current_user
    @item = Item.find(params[:id])

    if @item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 7]]